api/app/controllers/users_controller.rb

    def show
        user = params[:id] ? User.find_by(id: params[:id]) : @current_user
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]